In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv('/content/Placement_Data_Full_Class.csv')

In [4]:
data.drop('sl_no',axis = 1, inplace = True)

In [5]:
data.head()

  gender  ssc_p    ssc_b  hsc_p  ... specialisation  mba_p      status    salary
0      M  67.00   Others  91.00  ...         Mkt&HR  58.80      Placed  270000.0
1      M  79.33  Central  78.33  ...        Mkt&Fin  66.28      Placed  200000.0
2      M  65.00  Central  68.00  ...        Mkt&Fin  57.80      Placed  250000.0
3      M  56.00  Central  52.00  ...         Mkt&HR  59.43  Not Placed       NaN
4      M  85.80  Central  73.60  ...        Mkt&Fin  55.50      Placed  425000.0

[5 rows x 14 columns]

In [6]:
data.shape

(215, 14)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   gender          215 non-null    object
 1   ssc_p           215 non-null    float64
 2   ssc_b           215 non-null    object
 3   hsc_p           215 non-null    float64
 4   hsc_b           215 non-null    object
 5   hsc_s           215 non-null    object
 6   degree_p        215 non-null    float64
 7   degree_t        215 non-null    object
 8   workex          215 non-null    object
 9   etest_p         215 non-null    float64
 10  specialisation  215 non-null    object
 11  mba_p           215 non-null    float64
 12  status          215 non-null    object
 13  salary          148 non-null    float64
dtypes: float64(6), object(8)
memory usage: 23.6+ KB

In [8]:
data.isnull().sum()

gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

In [9]:
mask = pd.isnull(data['salary'])

In [10]:
data[mask].head(20)

   gender  ssc_p    ssc_b  hsc_p  ... specialisation  mba_p      status salary
3       M  56.00  Central  52.00  ...         Mkt&HR  59.43  Not Placed    NaN
5       M  55.00   Others  49.80  ...        Mkt&Fin  51.58  Not Placed    NaN
6       F  46.00   Others  49.20  ...        Mkt&Fin  53.29  Not Placed    NaN
9       M  58.00  Central  70.00  ...        Mkt&Fin  52.21  Not Placed    NaN
12      F  47.00  Central  55.00  ...         Mkt&HR  65.04  Not Placed    NaN
14      M  62.00  Central  47.00  ...         Mkt&HR  54.96  Not Placed    NaN
17      F  55.00  Central  67.00  ...        Mkt&Fin  67.28  Not Placed    NaN
18      F  63.00  Central  66.00  ...         Mkt&HR  64.08  Not Placed    NaN
25      F  52.58   Others  54.60  ...        Mkt&Fin  65.33  Not Placed    NaN
29      M  62.00  Central  67.00  ...        Mkt&Fin  51.29  Not Placed    NaN
31      F  67.00  Central  53.00  ...         Mkt&HR  58.32  Not Placed    NaN
34      M  62.00   Others  51.00  ...         Mkt&HR  62.77  Not Placed    NaN
36      M  51.00  Central  44.00  ...        Mkt&Fin  51.45  Not Placed    NaN
41      F  74.00   Others  63.16  ...         Mkt&HR  69.76  Not Placed    NaN
42      M  49.00   Others  39.00  ...        Mkt&Fin  51.21  Not Placed    NaN
45      F  76.00  Central  64.00  ...         Mkt&HR  66.53  Not Placed    NaN
46      F  70.89   Others  71.98  ...         Mkt&HR  71.63  Not Placed    NaN
49      F  50.00   Others  37.00  ...         Mkt&HR  56.11  Not Placed    NaN
51      M  54.40  Central  61.12  ...         Mkt&HR  62.65  Not Placed    NaN
52      F  40.89   Others  45.83  ...         Mkt&HR  65.49  Not Placed    NaN

[20 rows x 14 columns]

In [11]:
pd.crosstab(index = data['gender'], columns = data['status'])

status  Not Placed  Placed
gender
F               28      48
M               39     100

In [12]:
pd.crosstab(index = data['gender'], columns = data['status']).apply(lambda r: 100 * r/r.sum(), axis=1)

status  Not Placed     Placed
gender
F        36.842105  63.157895
M        28.057554  71.942446

In [13]:
pd.crosstab(index = data['ssc_b'], columns = data['status'])

status   Not Placed  Placed
ssc_b
Central          38      78
Others           29      70

In [14]:
pd.crosstab(index = data['hsc_s'], columns = data['gender'])

gender     F   M
hsc_s
Arts       6   5
Commerce  40  73
Science   30  61

In [15]:
pd.crosstab(index = data['degree_t'], columns = data['status']).apply(lambda r: r/r.sum(), axis=1)

status     Not Placed    Placed
degree_t
Comm&Mgmt    0.296552  0.703448
Others       0.545455  0.454545
Sci&Tech     0.305085  0.694915

In [16]:
pd.crosstab(index = data['status'], columns = data['specialisation']).apply(lambda r: 100 * r/r.sum(), axis=1)

specialisation    Mkt&Fin     Mkt&HR
status
Not Placed      37.313433  62.686567
Placed          64.189189  35.810811

In [17]:
pd.crosstab(index = data['specialisation'], columns = data['status']).apply(lambda r:100 *  r/r.sum(), axis=1)

status          Not Placed     Placed
specialisation
Mkt&Fin          20.833333  79.166667
Mkt&HR           44.210526  55.789474

In [18]:
# Dropping salary column as we do not require it for classification
data.drop('salary', axis = 1, inplace = True)

# Dropping the boards as it was not an important factor in determining placement status
data.drop(['ssc_b','hsc_b'],axis = 1, inplace = True)
data.head()

  gender  ssc_p  hsc_p     hsc_s  ...  etest_p specialisation  mba_p      status
0      M  67.00  91.00  Commerce  ...     55.0         Mkt&HR  58.80      Placed
1      M  79.33  78.33   Science  ...     86.5        Mkt&Fin  66.28      Placed
2      M  65.00  68.00      Arts  ...     75.0        Mkt&Fin  57.80      Placed
3      M  56.00  52.00   Science  ...     66.0         Mkt&HR  59.43  Not Placed
4      M  85.80  73.60  Commerce  ...     96.8        Mkt&Fin  55.50      Placed

[5 rows x 11 columns]

In [19]:
# Encoding our categorical values
data["gender"] = data.gender.map({'M':0,'F':1})
data["workex"] = data.workex.map({'No':0, 'Yes':1})
data['specialisation'] = data.specialisation.map({'Mkt&Fin':0,'Mkt&HR':1})
data['status'] = data.status.map({'Not Placed':0,'Placed':1})

In [20]:
for column in ['hsc_s', 'degree_t']:
    dummies = pd.get_dummies(data[column])
    data[dummies.columns] = dummies

In [21]:
data.drop(['hsc_s', 'degree_t'],axis = 1, inplace = True)

In [22]:
data.drop(['Arts', 'Others'], axis = 1,inplace = True)
data.head()

   gender  ssc_p  hsc_p  degree_p  ...  Commerce  Science  Comm&Mgmt  Sci&Tech
0       0  67.00  91.00     58.00  ...         1        0          0         1
1       0  79.33  78.33     77.48  ...         0        1          0         1
2       0  65.00  68.00     64.00  ...         0        0          1         0
3       0  56.00  52.00     52.00  ...         0        1          0         1
4       0  85.80  73.60     73.30  ...         1        0          1         0

[5 rows x 13 columns]

In [23]:
X = data.copy()
y = data['status']
X.drop('status', axis = 1, inplace = True)

In [24]:
from sklearn.preprocessing import StandardScaler

In [25]:
scaler = StandardScaler()
X_scaled = scaler.fit_transform(X)

In [26]:

from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X_scaled, y, test_size = 0.25, random_state = 3)

In [27]:
from sklearn.ensemble import RandomForestClassifier

In [28]:
from sklearn.metrics import accuracy_score, confusion_matrix

In [29]:
rf = RandomForestClassifier(random_state = 1)
rf.fit(X_train, y_train)
y_pred = rf.predict(X_test)

In [30]:
print(confusion_matrix(y_test, y_pred))

[[12  5]
 [ 3 34]]

In [31]:
rf = RandomForestClassifier(random_state = 1)
rf.fit(X_train, y_train)
y_pred = rf.predict(X_test)
accuracy_score(y_test, y_pred)

0.8518518518518519

**Libraries Imported**


1.   Pandas
2.   Numpy
3.   seaborn

**datapreprocessing**

* describing data based on mean
* Checking Datatypes
*  checking datatypes
*  scaling data
*  encoding mechanisms
*   checking status

**Algorithm**

RandomForest

**Why I Chosed RANDOMFOREST**

It is the most accurate Learning algorithm which runs efficiently on large database.It results high accurate score on any dataset compared to other classification Algorithms.